---
kind: method
id: M:Autodesk.Revit.DB.HomeCamera.Dispose
source: html/96d0752f-d79c-c7fc-9532-b324db97221a.htm
---
# Autodesk.Revit.DB.HomeCamera.Dispose Method

Releases all resources used by the HomeCamera

## Syntax (C#)
```csharp
public void Dispose()
```